htdocshotelsee/frontend/views/site/hotel.php


            </div>
            <?php
            $item_role=AuthAssignment::findOne(['user_id'=>Yii::$app->user->getId()]);
---
SELECT * FROM `auth_assignment` WHERE `user_id`=137