htdocshotelsee/frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $tabliq = Tbllink::find()->where(['id_hotel' => 0])->andWhere(['status' => 'index'])->all();
---
SELECT * FROM `tbllink` WHERE (`id_hotel`=0) AND (`status`='index')

    public function actionReport()
    {

//        $pro=\backend\models\Tblprofile::findOne($);

        if (!Yii::$app->user->isGuest) {

            $role = \frontend\models\AuthAssignment::findOne(['user_id' => Yii::$app->user->getId()]);
---
SELECT * FROM `auth_assignment` WHERE `user_id`=137




                            $list = Tblprofile::find()->where(['id_hotel' => $id_hotel])->andWhere(['date_enter' => date('Y/m/d')])->andWhere(['role' => 'user'])->count();

                            $romm = Tblroom::find()->where(['id_hotel' => $id_hotel])->all();
                            if ($romm != null) {
                                $empty = Tblroom::find()->where(['id_hotel' => $id_hotel])->andFilterWhere(['fill' => 0])->count();
                                              $fill = Tblroom::find()->where(['id_hotel' => $id_hotel])->andWhere(['fill' => 1])->count();
---
SELECT COUNT(*) FROM `tblprofile` WHERE (`id_hotel`='15') AND (`date_enter`='2018/10/20') AND (`role`='user')
SELECT * FROM `tblroom` WHERE `id_hotel`='15'
SELECT COUNT(*) FROM `tblroom` WHERE (`id_hotel`='15') AND (`fill`=0)
SELECT COUNT(*) FROM `tblroom` WHERE (`id_hotel`='15') AND (`fill`=1)

                                $fill = null;
                            }

                            $newmessage = Tblmessage::find()->where(['id_hotel' => $id_hotel])->andWhere(['visit' => 0])->count();
                            $oldmessage = Tblmessage::find()->where(['id_hotel' => $id_hotel])->andWhere(['visit' => 1])->count();
---
SELECT COUNT(*) FROM `tblmessage` WHERE (`id_hotel`='15') AND (`visit`=0)
SELECT COUNT(*) FROM `tblmessage` WHERE (`id_hotel`='15') AND (`visit`=1)

    public function actionHotels()
    {
        $tabliq = Tbllink::find()->where(['id_hotel' => 0])->andWhere(['status' => 'hotel'])->all();
        $hotels = Tbhotel::find()->all();
---
SELECT * FROM `tbllink` WHERE (`id_hotel`=0) AND (`status`='hotel')
SELECT * FROM `tbhotel`

    public function actionSearch()
    {

        $tabliq = Tbllink::find()->where(['id_hotel' => 0])->andWhere(['status' => 'hotel'])->all();
        $hotels = \frontend\models\Tbhotel::find()->filterWhere(['like', 'name_hotel', $_POST['name']])->all();
---
SELECT * FROM `tbllink` WHERE (`id_hotel`=0) AND (`status`='hotel')
SELECT * FROM `tbhotel`

    public function actionHotel()
    {
        $sesssion = yii::$app->session;
        if (!$sesssion->isActive) {
            $sesssion->open();
        }

        if (Yii::$app->request->get()) {
            $id = $_GET['id'];
            if ($id != null) {

                if (Yii::$app->user->isGuest) {

                    $_SESSION['id_hotel'] = $id;
                    return $this->redirect(['role']);
                } else {
                    $role = AuthAssignment::findOne(['user_id' => Yii::$app->user->getId()]);
                    if ($role->item_name == 'admin') {
                        $hotel = Tbhotel::findOne($id);
                        $tabliq = Tbllink::find()->where(['id_hotel' => $id])->orderBy(['id' => SORT_DESC])->all();

                        $khadamat = Tblcathotel::find()->where(['id_hotel' => $id])->orderBy([
                            'position' => SORT_DESC,
                        ])->all();
---
SELECT * FROM `auth_assignment` WHERE `user_id`=137
SELECT * FROM `tbhotel` WHERE `id`='15'
SELECT * FROM `tbllink` WHERE `id_hotel`='15' ORDER BY `id` DESC
SELECT * FROM `tblcathotel` WHERE `id_hotel`='15' ORDER BY `position` DESC

    public function actionSignup()
    {

        if (isset($_SESSION['role']) && $_SESSION['role'] != null && isset($_SESSION['id_hotel']) && $_SESSION['id_hotel'] != null) {
            if ($_SESSION['role'] == 'user') {
                $role = 'user';
            } else {
                $role = 'manager';
            }
            $model = new SignupForm();
            $hotel = \frontend\models\Tbhotel::findOne($_SESSION['id_hotel']);
            if ($hotel != null) {
                $rooms = ArrayHelper::map(Tblroom::find()->where(['id_hotel' => $hotel->id])->andFilterWhere(['fill' => 0])->all(), 'number', 'number');
---
SELECT * FROM `tbhotel` WHERE `id`='15'
SELECT * FROM `tblroom` WHERE (`id_hotel`=15) AND (`fill`=0)