htdocshotelsee/frontend/views/layouts/main.php

SELECT * FROM `auth_assignment` WHERE `user_id`=137
---

        <?php
        if(!Yii::$app->user->isGuest){
            $role=\frontend\models\AuthAssignment::findOne(['user_id'=>Yii::$app->user->getId()]);

SELECT * FROM `auth_assignment` WHERE `user_id`=137
---
        if(!Yii::$app->user->isGuest){
            ?>
            <?php
            $role=AuthAssignment::findOne(['user_id'=>Yii::$app->user->getId()]);